{
    "source": "ArXiv (Semantic Scholar未收录)",
    "arxiv_id": "2507.14059",
    "link": "https://arxiv.org/abs/2507.14059",
    "pdf_link": "https://arxiv.org/pdf/2507.14059.pdf",
    "title": "Design of a Modular Mobile Inspection and Maintenance Robot for an Orbital Servicing Hub",
    "authors": [
        "Tianyuan Wang",
        "Mark A Post",
        "Mathieu Deremetz"
    ],
    "publication_date": "未找到提交日期",
    "venue": "暂未录入Semantic Scholar",
    "fields_of_study": "暂未录入Semantic Scholar",
    "citation_count": "暂未录入Semantic Scholar",
    "influential_citation_count": "暂未录入Semantic Scholar",
    "paper_content": "# Design of a Modular Mobile Inspection and Maintenance Robot for an Orbital Servicing Hub\n\nTianyuan Wang1[0000−0003−3545−4937], Mark A Post1[0000−0002−1925−7039], and Mathieu Deremetz $^ 2$\n\n$^ { 1 }$ University of York, Heslington, York, England, YO10 5DD {tianyuan.wang,mark.post}@york.ac.uk https://www.york.ac.uk/physics-engineering-technology/ 2 Space Applications Services NV/SA, Leuvensesteenweg 325, 1932 Sint-Stevens-Woluwe, Belgium mathieu.deremetz@spaceapplications.com https://www.spaceapplications.com/\n\nAbstract. The use of autonomous robots in space is an essential part of the “New Space” commercial ecosystem of assembly and re-use of space hardware components in Earth orbit and beyond. The STARFAB project aims to create a ground demonstration of an orbital automated warehouse as a hub for sustainable commercial operations and servicing. A critical part of this fully-autonomous robotic facility will be the capability to monitor, inspect, and assess the condition of both the components stored in the warehouse, and the STARFAB facility itself. This paper introduces ongoing work on the STARFAB Mobile Inspection Module (MIM). The MIM uses Standard Interconnects (SI) so that it can be carried by Walking Manipulators (WM) as an independently-mobile robot, and multiple MIMs can be stored and retrieved as needed for operations on STARFAB. The MIM carries high-resolution cameras, a 3D profilometer, and a thermal imaging sensor, with the capability to add other modular sensors. A grasping tool and torque wrench are stored within the modular body for use by an attached WM for maintenance operations. Implementation and testing is still ongoing at the time of writing. This paper details the concept of operations for the MIM as an on-orbit autonomous inspection and maintenance system, the mechanical and electronic design of the MIM, and the sensors package used for non-destructive testing.\n\nKeywords: Space Robotics · Servicing · Maintenance · Inspection · Non-Destructive Testing\n\n# 1 Introduction\n\nOuter space has become easier to access than ever before with the advent of low-cost commercial launch technologies and improvements in space technology, communications and robotics. However, the current practice of simply launching single-use bespoke missions from Earth is not economical and sustainable, and the development of In-space Service, Assembly and Maintenance (ISAM) technologies has taken priority to facilitate this new ecosystem. The “New Space”\n\nor “Big Space” model that is now evolving envisions the use of modular space technologies with universal interoperability that can be assembled, deployed, retrieved, and maintained fully or partly autonomously through the use of robotics in Earth orbit and beyond. With this model comes the need for in-space robotic storage and handling of required items and resources, which we propose can be fulfilled in the form of an “Orbital Hub” that serves as a unified warehousing, assembly, and maintenance facility to which servicer spacecraft could dock and launch carrying with them satellites composed of modular components that can be serviced and reconfigured. To this end, the project “A Space Warehouse Concept and Ecosystem to Energize European ISAM (STARFAB)” [5] introduces a novel concept, the Orbital Automated Warehouse Unit (also known as the Orbital Depot), which serves as a backbone and enabler for sustainable ISAM commercial activities [2]. The introduction of capability to warehouse, reconfigure, and redeploy modular spacecraft components on-orbit brings with it the necessity to regularly inspect and maintain components remotely and at least semi-autonomously. The Inspection and Maintenance (I&M) capabilities within STARFAB focus on the detection, diagnosis, and reporting of malfunction or damage to facilities, systems, and contents. Non-destructive testing (NDT) methods provide the lifecycle analysis with failure prediction and diagnosis capability needed to plan the deployment and operation of modular spacecraft. STARFAB also needs the capability to carry out light maintenance interventions robotically and on demand, to implement planned or unplanned maintenance of the facilities. Complex interventions are not considered at present due to the high fundamental complexity of robotic maintenance activities on-orbit. The Inspection and Maintenance robot for STARFAB is designed as a self-contained spacecraft module called the Mobile Inspection Module (MIM). The MIM uses HOTDOCK (HD) Standard Interconnects (SI) so that it can be carried by Walking Manipulators (WM) and other mobile subsystems [4]. It also operates like any other self-contained modular element in the system with independent power and processing resources, and multiple MIMs can be stored and retrieved as needed for operations on STARFAB.\n\n# 2 System Design\n\nRequirements Table 1 summarizes the Inspection and Maintenance requirements for STARFAB. The main inspection and maintenance challenges for STARFAB are due to requiring autonomous operation in a minimally-controlled vacuum and irradiated environment with extremes of temperature. This limits feasible NDT techniques at present to remotely-deployable optical sensing methods applicable to inspecting a wide range of materials and parts. Based on this set of requirements, the MIM is designed to carry a high-resolution machine vision camera with encircling illumination unit, optical 3D scanner, and thermal imaging camera. Maintenance activities are accomplished by using an additional WM to attach and manipulate a grasping tool and torque wrench.\n\nConcept of Operations The primary use case for the MIM is the inspection of modular spacecraft components known as Orbital Replacement Units (ORUs) and components while they are on route to or from the primary structure. The\n\nTable 1: Inspection and Maintenance Requirements   \n\n<html><body><table><tr><td>Element</td><td>Requirement</td></tr><tr><td>Payloads</td><td>Automated NDT is possible for all payloads on all external surfaces.</td></tr><tr><td>Spacecraft</td><td>Hosted spacecraft shall be inspected externally without disassembly.</td></tr><tr><td>Profilometry</td><td>Scratch/deformationdamage detected fromdebris larger than O.3mm.</td></tr><tr><td>Resolution</td><td>Debris impact damage detectable down to O.6mm diametric size.</td></tr><tr><td>Reliability</td><td>Damage features detected with 9O% probability to confidence of 95%.</td></tr><tr><td>Range</td><td>Inspection within a range of O.2m to 2m from the sensor array.</td></tr><tr><td>Thermal</td><td>Inspection distinguishes localized temperatures of-40C to 150C.</td></tr><tr><td>Illumination</td><td>Ring-topology visible spectrum illumination source is carried for vision.</td></tr><tr><td>Handling</td><td>Replacement partshandled and placedusing dedicated robotic tools.</td></tr><tr><td>Grasping</td><td>Gripper tool can grasp objects with dimensions from O.5cm to 10cm.</td></tr><tr><td>Torque</td><td>Torque tool compatible to NASA PGT tool one;2.7Nm to 30Nm.</td></tr></table></body></html>\n\nMIM must be capable of being positioned at any stage of the ORU’s movement, while aiming to keep the primary structure unobstructed. The secondary use case for the MIM is inspection of the structural integrity of STARFAB itself, from both interior and exterior positions, and that of docked servicer spacecraft. The MIM can be be positioned by “walking” over designated fixture points on the structure with WMs, transported by attaching via a WM to a shuttle system, or attached in place to a fixture point via a WM as an “eye in hand” sensor.\n\n![](images/735da146e77a6f269f1ab05931f7549d13cd98069155d99f17bd7ee152c289a6.jpg)  \nFig. 1: Operations of the MIM performing I&M inside and outside STARFAB.\n\n# 3 Mechanical Design\n\nForm Factor The form factor of the MIM is based on the Multi-Arms Robot (MAR) developed for on-orbit large telescope assembly [1]. Design underwent three major iterations with careful consideration given to the I&M requirements, as well as ensuring compatibility with the STARFAB’s existing system, which eventually led to a final iteration that aligned with the MAR form factor, shown in Figure 2, to achieve several objectives. First, adopting the MAR torso’s form factor allows the MIM to utilize the same kinematic configuration, ensuring seamless integration with the existing system. Second, the evenly distributed three HDs, when paired with the WM, provide enhanced flexibility, where the third HD can be positioned as needed to interface with tools. The MAR torso’s top view features a hexagonal shape with unequal sides. The MIM’s sensor components are mounted on one of the longer sides within a cylindrical-like enclosure capable of tilt movement. When the sensor interface is oriented forward, two WMs are mounted on the left and rear HDs, allowing for autonomous movement, while the HD on the right side is reserved for an additional robotic arm, either a WM or a lighter alternative, for tool retrieval, manipulation, and storage. This configuration enables the MIM to interact with tools through an independent robotic arm, providing greater degrees of freedom. The tools are stored within the open-sided compartments on the two sides of the MIM main body under the lid. These compartments take space both internally and externally to the original MAR torso profile to achieve a balance between the WM-to-tool interference and the tool carrying capacity.\n\n![](images/17ca3619bd9d318b087e0e3026e8493dcbc72d975d0839b0207a3154aa47102e.jpg)  \nFig. 2: Mechanical design of the MIM. (a) An overview of the MIM with HDs attached. (d) An exploded view of the main constituent parts of the MIM.\n\nInterfacing The three HDs at the corners of the MIM chassis interface to WMs, payloads, and other modular components. Specifications including quantity and placements of the HDs depend on the configuration of how the MIM is to be integrated with other STARFAB modular systems. As a modular system, the MIM is designed to be flexible enough to fulfil many different roles, as shown in Figure 3. These include, for example, when operating as an independent robot, it will have two WMs attached, which operate as “legs”, to walk across infrastructure’s attachment points. This allows it to reach external locations on the warehouse unit and areas not easily within reach of manipulators. When operating as a payload for the WM, with the WM mounted on a shuttle or fixed attachment point, the MIM can be flexibly positioned for inspection using one WM. When operating as a payload for the external Large Arm of STARFAB, the MIM is held by the grapple fixture and positioned above the area to be inspected. The manipulation of tools is accomplished by attaching a WM to an unused HD on the MIM to access tools in the tool storage. Tools are then used by the WM with a camera integrated within the WM operating as an “eye-in-hand” sensor and within the view of the MIM’s sensor package, which then operates as an “eye-to-hand” sensor.\n\nPower Given the constraints on mass and energy consumption inherent in space applications, the internal electronics of the MIM are designed to be minimalistic, operating at 24V with a power consumption of approximately 5W per unit, except for the on-board computer (OBC) and illumination source. Mass reduction remains a primary concern, as the flight version of the MIM is larger and heavier than ground applications. The power bus on the robotic arm operates at 48V, allowing for more efficient power distribution with a current limitation of around 14A for the entire robot.\n\n![](images/ff0ffac71dd99fddf759e4aff3374f749a930aa57928f8d38c282e964bd29176.jpg)  \nFig. 3: Example configurations of the MIM. From (a) to (d): walking configuration, externally mounted configuration, large arm mounted configuration, and maintenance MIM Configuration.\n\n![](images/5d12b01fe40cff247a5e95fafe11851757fe399aba1db6b2cefb4a09f99a236b.jpg)  \nFig. 4: Block diagram of MIM systems with interfacing to external systems.\n\n# 4 Sensor and Processing Hardware Selection\n\nOn-Board Computing The computing hardware for the MIM must have the capacity to run image and signal processing algorithms in real time for I&M purposes. While future flight hardware and software will be significantly different, for terrestrial testing an OBC running Linux is used to facilitate experimentation with algorithms from the OpenCV machine vision library, Point Cloud Library (PCL), and the InFuse Space Robotics Common Data Fusion Framework (CDFF) [3]. The central OBC on the MIM is an Nvidia Jetson Orin Nano developer board, which has sensor hardware acceleration in Linux and uses ROS2 over Ethernet as a system bus to other components.\n\n![](images/8ae66e77891bf2db3e985e2dd49b5538278c449e12d282ee877597d38c35d8c1.jpg)  \nFig. 5: Prototype of the sensor enclosure and containing perception electronics. From (a) to (c): the 3D, front, and top view of the enclosure and electronics.\n\n![](images/2ac7a09fd20ab7df0ad2208941b7230415977c0941bdb68e65085662594eb5a6.jpg)  \nFig. 6: Initial data from the MIM’s onboard sensors. (a) 3D scanner generated mesh model. (b) Sensor readout visualized on the rviz2 interface.\n\nPerception Sensors To fulfil the I&M requirements, the sensors in the MIM primarily cover RGB, depth, point cloud, and thermal imaging domains. A block diagram of the system framework and the prototype of the sensor enclosure are shown in Figure 4 and 5, respectively. For RGB images, to ensure the sharpness of objects captured at different distances, camera with a zoom lens and local image processing capability is preferred. For better compatibility with the OBCs and ROS2 communication middleware, the Raspberry Pi 5 with Pi Camera 3 sensors was selected. They are mounted at the four corners of the sensor enclosure’s front panel, providing a wide field of view around potential obstructions. Although these cameras are expected to be sufficient for depth imaging, capacity for an accelerated ZED X stereo camera is included for testing purposes. For sub-millimetre surface profiling, most LIDAR units have insufficient point cloud density, so a Matter And Form THREE 3D structured light camera system is used to achieve sufficient surface resolution while internally handling additional processing overheads. Coarse resolution thermal imaging is used to detect the presence of operational anomalies that cause lack of activity or overheating. For appropriate dynamic range with a small footprint, a Waveshare Long-wave IR Thermal Imaging Camera with 80 $\\times$ 62 resolution is used.\n\n# 5 Conclusions\n\nThe STARFAB Mobile Inspection Module represents a novel modular approach to inspection and maintenance, suitable for the flexible ecosystems of space hardware components needed to achieve sustainable autonomous operations in Earth orbit and beyond. The next steps in MIM development are to test the complete prototype in identifying and profiling ORUs and STARFAB structural elements as a platform for algorithm development to achieve the I&M performance requirements. Following verification activities, a MIM with aluminium chassis and near-flight capable components will perform autonomous inspection and maintenance as part of the STARFAB project demonstration in mid-2026.",
    "institutions": [
        "University of York",
        "Space Applications Services NV/SA"
    ],
    "summary": "{\n    \"core_summary\": \"### 核心概要\\n\\n**问题定义**\\n目前从地球发射一次性定制任务既不经济也不可持续，“新太空”模式需要在太空中对所需物品和资源进行机器人存储和处理，并定期对模块化航天器组件进行远程且至少半自主的检查和维护。此问题的重要性在于推动可持续的太空商业活动，实现太空硬件组件在地球轨道及更远空间的组装和再利用。\\n\\n**方法概述**\\n本文介绍了STARFAB移动检查模块（MIM），它使用HOTDOCK（HD）标准互连（SI），可由步行操纵器（WM）携带，能独立运行且可按需存储和检索。MIM搭载了高分辨率机器视觉相机、光学3D扫描仪、热成像相机等多种传感器，还可存储抓握工具和扭矩扳手用于维护操作。\\n\\n**主要贡献与效果**\\n- 提出了适用于太空硬件组件检查和维护的模块化方法，为实现可持续自主太空操作提供了新途径。\\n- MIM的设计满足了一系列检查和维护要求，如能检测直径低至0.6mm的碎片撞击损伤，能检测大于0.3mm碎片造成的划痕/变形损伤，以90%的概率和95%的置信度检测损伤特征等。\\n- 设计的MIM在2026年年中作为STARFAB项目演示的一部分，将使用铝制底盘和接近飞行能力的组件进行自主检查和维护。\",\n    \"algorithm_details\": \"### 算法/方案详解\\n\\n**核心思想**\\n基于太空自主操作的需求和当前非破坏性测试技术在极低温、高辐射真空环境下的限制，设计MIM使其具备独立的动力和处理资源，采用模块化设计，能够在多种场景下通过标准互连（SI）与行走机械臂（WM）等移动子系统配合，灵活定位并执行检查和维护任务，利用多种传感器获取所需信息。其有效性在于能够适应太空环境的复杂性，完成对模块化航天器组件和设施的全面检查与维护。\\n\\n**创新点**\\n先前可能缺乏专门针对太空环境下模块化航天器组件检查和维护的统一解决方案，且太空检查和维护工作可能缺乏模块化和灵活性。MIM采用模块化设计，可按需存储和检索，多个MIM可协同工作，使用HOTDOCK（HD）标准互连（SI）与步行操纵器（WM）等灵活配合，并且使用了多种先进的传感器，如高分辨率机器视觉相机、光学3D扫描仪和热成像相机等，提高了检查的准确性和可靠性。\\n\\n**具体实现步骤**\\n1. 根据STARFAB的检查和维护要求，确定MIM搭载的传感器（高分辨率机器视觉相机、光学3D扫描仪、热成像相机等）和维护工具（抓取工具和扭矩扳手）。\\n2. 进行机械设计，采用基于多臂机器人（MAR）的外形设计，合理布局三个HD标准互连，确保MIM与现有系统的无缝集成和操作灵活性。MIM的传感器组件安装在类似圆柱形的可倾斜外壳内，工具存储在主体两侧的开放式隔层中。\\n3. 选择合适的计算硬件和传感器，中央OBC采用Nvidia Jetson Orin Nano开发者板，搭载Raspberry Pi 5与Pi Camera 3传感器、Matter And Form THREE 3D结构化光相机系统、Waveshare长波红外热成像相机等。\\n4. 进行测试和验证，在识别和分析轨道替换单元（ORUs）和STARFAB结构元素时测试完整原型，以开发算法满足检查和维护性能要求。\\n\\n**案例解析**\\n论文未明确提供此部分信息\",\n    \"comparative_analysis\": \"### 对比实验分析\\n\\n**基线模型**\\n论文未明确提供此部分信息\\n\\n**性能对比**\\n论文未明确提供此部分信息\",\n    \"keywords\": \"### 关键词\\n\\n- 太空机器人 (Space Robotics, N/A)\\n- 太空服务与维护 (Space Servicing and Maintenance, N/A)\\n- 移动检查模块 (Mobile Inspection Module, MIM)\\n- 非破坏性测试 (Non-Destructive Testing, NDT)\"\n}"
}