{
    "link": "https://arxiv.org/abs/2410.05695",
    "pdf_link": "https://arxiv.org/pdf/2410.05695",
    "title": "Unlocking the Capabilities of Thought: A Reasoning Boundary Framework to Quantify and Optimize Chain-of-Thought",
    "authors": [
        "Qiguang Chen",
        "Libo Qin",
        "Jiaqi Wang",
        "Jinxuan Zhou",
        "Wanxiang Che"
    ],
    "institutions": [
        "SCIR"
    ],
    "publication_date": "2024-10-08",
    "venue": "Neural Information Processing Systems",
    "fields_of_study": [
        "Computer Science"
    ],
    "citation_count": 39,
    "influential_citation_count": 2,
    "paper_content": "# Unlocking the Capabilities of Thought: A Reasoning Boundary Framework to Quantify and Optimize Chain-of-Thought\n\nQiguang Chen† Libo $\\mathbf { Q } \\mathbf { i n } ^ { \\ddag \\ast }$ Jiaqi Wang♢ Jinxuan Zhou‡ Wanxiang Che†∗\n\n† Research Center for Social Computing and Information Retrieval † Harbin Institute of Technology ‡ School of Computer Science and Engineering, Central South University ♢ The Chinese University of Hong Kong {qgchen,car}@ir.hit.edu.cn, lbqin@csu.edu.cn\n\n# Abstract\n\nChain-of-Thought (CoT) reasoning has emerged as a promising approach for enhancing the performance of large language models (LLMs) on complex reasoning tasks. Recently, a series of studies attempt to explain the mechanisms underlying CoT, aiming to deepen the understanding of its efficacy. Nevertheless, the existing research faces two major challenges: (1) a lack of quantitative metrics to assess CoT capabilities and (2) a dearth of guidance on optimizing CoT performance. Motivated by this, in this work, we introduce a novel reasoning boundary framework (RBF) to address these challenges. To solve the lack of quantification, we first define a reasoning boundary (RB) to quantify the upper-bound of CoT and establish a combination law for RB, enabling a practical quantitative approach applicable to various real-world CoT tasks. To address the lack of optimization, we propose three categories of RBs. We further optimize these categories with combination laws focused on RB promotion and reasoning path optimization for CoT improvement. Through extensive experiments on 27 models and 5 tasks, the study validates the existence and rationality of the proposed framework. Furthermore, it explains the effectiveness of $1 0 \\mathrm { C o T }$ strategies and guides optimization from two perspectives. We hope this work can provide a comprehensive understanding of the boundaries and optimization strategies for reasoning in LLMs. Our code and data are available at https://github.com/LightChen233/reasoning-boundary.\n\n# 1 Introduction\n\nIn recent years, Large Language Models (LLMs) have demonstrated increasing capabilities and applications across various tasks [Zhao et al., 2023, Chang et al., 2023, Pan et al., 2023, Qin et al., 2024a]. Notably, advanced LLMs, such as GPT [Brown et al., 2020, OpenAI, 2022, 2023], PaLM [Anil et al., 2023] and LlaMa [Touvron et al., 2023a,b, Meta, 2024] series have demonstrated emergent capabilities, particularly like Chain-of-Thought (CoT) [Nye et al., 2022, Wei et al., 2022]. This methodology enables models to verbalize step-by-step reasoning, thereby enhancing prediction accuracy by basing decisions on the logical rationale [Wei et al., 2022, Kojima et al., 2022, Hu et al., 2024, Qin et al., 2023, Zhuang et al., 2023, Chen et al., 2024a].\n\nRecently, some research in the literature has begun to investigate the mechanism of CoT to enhance the understanding of its operational nature. To this end, Madaan et al. [2023] and Wang et al. [2023a] first give a qualitative boundary conclusion through a large number of experiments on the natural language planning capability: The CoT is limited by the reasoning logic in the context demonstrations. Bi et al. [2024] investigate these boundaries on the code planning capability, by training LLMs on CoT samples of varying difficulties. It demonstrates LLMs are unable to learn or effectively manage tasks that exceed a certain complexity upper-bound. To delve deeper into potential constraints of CoT, Feng et al. [2024] develop a theoretical framework on the single-step calculation capability, suggesting that there is an upper-bound of model performance dependent on the length of input in single-step reasoning processes. Although existing research has made some progress, where the boundaries of CoT lie and how these boundaries affect the performance of CoT are still unresolved questions. Specifically, the existing work still faces two major challenges:\n\n• Lacking quantification metrics for CoT: Current research primarily relies on qualitative assessments of CoT performance, which leads to the absence of quantitative metrics. It hinders the ability to objectively compare different CoT approaches and establish a definitive upper-bound for CoT capabilities.   \n• Lacking optimization guidance for CoT: While current research prioritizes understanding the mechanisms underlying CoT reasoning, there is a dearth of guidance on optimizing CoT performance. This gap hinders the transformation of CoT research into actionable strategies for enhancing model capabilities.\n\nMotivated by this, in this work, we introduce a reasoning boundary framework (RBF) to thoroughly examine and optimize the boundaries of current LLMs. Specifically, to address the quantification challenge, we propose a new concept, named reasoning boundary (RB) to quantify the upper-bound on task-specific reasoning complexity within a model. Furthermore, to explore more practical scenarios, we present the combination law of RBs to generalize the RB for quantification in more real and complex scenarios. To address the CoT optimization challenge, we propose and analyze three reasoning boundary intervals, guiding optimization through improved RB and optimized reasoning paths based on the combination law, which achieves state-of-the-art performance in our proposed benchmark. We extensively validate the efficacy of our framework across 27 models and 5 tasks: arithmetic computing, mathematical reasoning, multi-hop question answering, and multilingual mathematical reasoning.\n\nOur main contributions are as follows:\n\n• To the best of our knowledge, this is the first work to propose a reasoning boundary framework (RBF) to quantify the upper-bound of CoT. Furthermore, we establish the combination law of RB as the weighted harmonic mean of fundamental RBs to address practical CoT tasks. • To solve the lack of CoT optimization, we define three categories of RBs. Based on the combination law and the nature of these RBs, we effectively improve the existing CoT strategies by RB promotion and reasoning path optimization. • We validate the existence and rationality of our framework on 27 models and 5 CoT tasks. Furthermore, we explain the optimal performance from two optimization perspectives in numerous CoT strategies. We consider both optimal perspectives and propose a minimum acceptable reasoning path (MARP) prompting to achieve state-of-the-art performance.\n\n# 2 Quantification Methodology\n\n# 2.1 Reasoning Boundary\n\nIn order to quantify the capacity for complex reasoning in LLMs, we introduce an upper-bound concept termed reasoning boundary (RB), which formally defines the degree of ease that an LLM can handle within a specific reasoning process. In simpler terms, as shown in Figure 1 (a), RB reflects the limit beyond which a model’s accuracy significantly degrades. Mathematically, RB is defined for a model $m$ and a task $t$ as the maximum of problem difficulty $d$ at which the model’s accuracy reaches a predefined threshold $K _ { 1 }$ :\n\n$$\nB _ { A c c = K _ { 1 } } ( t | m ) = \\operatorname* { s u p } _ { d } \\{ d | A c c ( t | d , m ) = K _ { 1 } \\} ,\n$$\n\nwhere $A c c ( t | d , m )$ represents the accuracy of the model’s accuracy on task $t$ with difficulty $d$ .   \nDifficulty can be measured by factors like the number of reasoning steps or computational complexity.   \nFor brevity, we denote RB as $B ( t | m )$ in subsequent sections.\n\n(a) Reasoning Boundary (§2.1) (b) Combination Law of Reasoning Boundary (§2.2) Arithmetical Calculation $^ +$ Planning $$ Mathematical Reasoning 𝓑Ac=90% Acc=90% (1+2)\\*3 – 4 = ? 𝓑Ac=50% Acc=50% 5 1+2=?; 3\\*3=?; … cAulraitihomneRtiBca(l𝓑C(a𝒂l)-) Weighted Harmonic Mean ReasoMnaitnhgeRmBat(ic𝓑a(l𝒂, 𝒑)) calculate that Joan is 1+2=3 Step 1: First you need to (112+21)\\*3=? 399 Natural Language ySteeapr o2l: .Then you need to 𝓑Ac=10% Acc=10% Step1:PlFairnsnt iynoguRneBe(d𝓑t(o𝒑…)) cyaelacrusloatled…that Jack is $3 ^ { * } 3 \\mathrm { = } 9$ (1123+231)\\*332 1,209,653 Step2: Then you need to (c) Categories of Reasoning Boundary (§2.3) 𝓑Acc≥90% 𝓑10%<Acc<90% 𝓑Acc≤10% Reasoning Completely Feasible Reasoning Partially Feasible Reasoning Completely Infeasible Reasoning Boundary Boundary (CFRB) Boundary (PFRB) Boundary (CIRB)\n\nConclusion: The reasoning boundary for a model is defined by its ability to achieve a specific accuracy for a given task difficulty.\n\n# 2.2 Combination Law of Reasoning Boundary\n\nIn practical scenarios, models often require the integration of multiple capabilities to address a single task effectively. To quantify how a large language model can be boosted by the cooperation of multiple capabilities through the CoT mechanism, we introduce the “Combination Law of $R B ^ { \\prime }$ , giving a concrete formula of the upper-bound of the CoT. The law estimates the unified reasoning boundary $\\mathcal { B } _ { \\mathrm { A c c } = K _ { 1 } } ( t _ { 1 } , t _ { 2 } , \\dots , t _ { n } | m )$ for $n$ tasks within a model $m$ , which is formulated as:\n\n$$\n\\begin{array} { r } { \\mathcal { B } _ { \\mathrm { A c c } = K _ { 1 } } \\bigl ( t _ { 1 } , t _ { 2 } , \\ldots , t _ { n } \\vert m \\bigr ) \\approx \\frac { 1 } { \\bigl ( n - 1 \\bigr ) \\sum _ { i = 1 } ^ { n } \\frac { N _ { i } } { \\mathcal { B } _ { \\mathrm { A c c } = K _ { 1 } } ( t _ { i } \\vert m ) - b _ { i } } } , } \\end{array}\n$$\n\nwhere $B _ { \\mathrm { A c c } = K _ { 1 } } ( t _ { i } | m )$ denotes the reasoning boundary of model $m$ for task $t _ { i }$ . $N _ { i }$ , and $b _ { i }$ are scaling factors, which are only affected by the related task. As shown in Figure 1 (b), Equation (2) provides a mathematical formula to estimate the combined RBs from the independent ones, enabling deeper insights into model behavior for intricate tasks. See Appendix A for detailed mathematical analysis.\n\nFurthermore, the combination law for reasoning boundary demonstrates favorable theoretical properties, with broad applicability across diverse scenarios and flexibility in accommodating various boundary segmentation methods. For detailed practical application, please refer to Appendix B.\n\nConclusion: The combination law of reasoning boundary satisfies the weighted harmonic average of each basic reasoning boundary.\n\n# 2.3 Categories of Reasoning Boundary\n\nFurthermore, in order to guide the optimization of CoT and more convenient expression, as shown in Figure 1 (c), we define the following three categories of RBs based on their empirical accuracy:\n\nCompletely Feasible Reasoning Boundary: We define that the part with an accuracy greater than $90 \\%$ is a completely feasible reasoning boundary $( \\mathrm { C F R B } = \\mathcal { B } _ { \\mathrm { A c c \\geq 9 0 \\mathcal { Y } _ { 0 } } } ( t _ { 1 } , t _ { 2 } , \\dots , t _ { n } | m ) )$ , which means that LLMs can effectively grasp the performance of this part.\n\nCompletely Infeasible Reasoning Boundary: We believe that the part with an accuracy less than $10 \\%$ is a completely infeasible reasoning boundary $( \\mathrm { C I R B } = \\mathcal { B } _ { \\mathrm { A c c \\leq 1 0 \\% } } ( t _ { 1 } , t _ { 2 } , \\dots , t _ { n } | m ) )$ , which means that the model can never effectively grasp the performance of this part.\n\nPartially Feasible Reasoning Boundary: We define the RB in the rest part except CFRB and CIRB as a partially feasible reasoning boundary $( \\mathtt { P F R B } = \\mathcal { B } _ { 1 0 \\% < \\mathrm { A c c } < 9 0 \\% } ( t _ { 1 } , t _ { 2 } , . . . , t _ { n } | m ) )$ , which requires the model to repeat thinking or more clear information to solve the problem.\n\n100 100 . Correct Incorrect CFRB PFRB CIRB 1000 1500 640 Accuracy (%) 8 40 =2e6 500 20 20 x\\*y =2.2e5 0 0 □ 0 500 1000 1500 2000 1 3 5 7 9 11 13 15 1 3 5 7 9 11 13 15 x The number of planning step $\\mathbf { \\sigma } ( { \\mathcal { B } } ( { \\mathfrak { p } } ) )$ The number of planning step $\\mathbf { \\gamma } ( \\mathcal { B } ( \\mathbf { p } ) )$ (a) Distribution of correct predictions (b) Distribution of correct predictions (c) Distribution of correct predictions for $\\mathbf { x } ^ { * } \\mathbf { y }$ samples. for nature language planning. for code planning.\n\nWe analyze the nature of these three categories of RB in detail (in Section 4.3), and further utilize the combination law to optimize these three reasoning boundaries (in Section 5), so as to provide effective suggestions and guidance to support future CoT optimization.\n\n# 3 Experimental Setup\n\nBenchmark Settings To assess the reasoning boundaries of LLMs, we require a dataset rich in RB. This necessitates tasks with evenly distributed complexities and reasoning steps that challenge the models’ upper-bounds. To meet these requirements, we introduce BIGGSM, a new dataset offering greater calculation complexity and longer reasoning chains. The detailed construction process for BIGGSM is provided in Appendix C.\n\nModel Settings Except for model expansion experiments, all experiments are conducted on GPT3.5-Turbo. Following the setting of Wei et al. [2022], in our CoT experiment, all multi-step reasoning tasks utilize three manually constructed demonstrations. In addition, for all the experiments, top-p is selected from $\\{ 0 . 9 5 , 1 \\}$ . Temperature is selected from $[ 0 , 1 ]$ and serves as the main error variable.\n\n# 4 Empirical Analysis of Reasoning Boundary\n\n# 4.1 Existence Verification for Reasoning Boundary\n\nIn this study, we investigate the hypothesis that an LLM exhibits varying levels of reasoning boundary across various tasks. To this end, we will verify whether the model has widespread reasoning boundary in various tasks in the following three tasks:\n\nBasic Arithmetic Calculation First, to investigate the existence of RB, we first examine basic arithmetic operations (including addition, subtraction, multiplication, and division). As illustrated in Figure 2 (a), the results reveal significant performance variations across three distinct regions. For multiplication, accuracy surpasses $90 \\%$ for results up to $2 . 2 e 5$ . Conversely, accuracy falls below $10 \\%$ for products exceeding 2e6. Similar presences of varying RBs are observed for other operations, which verifies the existence of reasoning boundary in basic arithmetic calculation tasks. Further results and implementation details are provided in Appendix D.\n\nNature Language Planning We further investigate RB in natural language planning tasks for mathematical reasoning. We prompt the model to generate plans and assess their accuracy through manual evaluation. There is a strong correlation between the number of reasoning steps and LLMs’ performance in Figure 2 (b). When the model meets the question with fewer than 2 reasoning steps, accuracy surpasses $90 \\%$ . Conversely, when reasoning steps exceed 4, accuracy falls below $10 \\%$ . This finding suggests that there are also three different RB categories in natural language planning tasks.\n\nCode Planning For further extensive exploration, we further prompt LLMs by PAL [Gao et al., 2023] to generate code-format plans and evaluate them by manual annotation. As shown in Figure 2 (c), the code planning task is similar to natural language planning, which is also an obvious division and different categories of RBs. Notably, since code planning utilizes code for clearer logic and reduced expression complexity, its planning accuracy surpasses that of natural language planning.\n\nCorrect sample X Incorrect sample CFRB PFRB CIRB Maximum multiplication calculation value (𝓑(m)) 1e5 Maximum multiplication calculation value (𝓑(m)) 3e5 ！ XX X The number of entity (𝓑(e))12108642 xx X X 8e4 O ×\\* X 2.5e5 × x×× 64e4 XxX 1.52e5 B XX 2e4 51e54 美女安 L 茶 0 0 5 X 10 xx 15 20 0 1 i 4 美菱 7 + X 10 13 ? 16 0 10 20 30 40 The number of calculation step (𝓑(s)) The number of planning step (𝓑(p)) The number of hop (𝓑(h)) (a) The combination law of different (b) The combination law of different (c) The combination law of different reasoning boundaries in complex reasoning boundaries in mathematical reasoning boundaries in multi-hop calculation task. reasoning task. question-answering task.\n\n# 4.2 Combination Law Verification on Different Tasks\n\nCombination Law in Complex Arithmetic Calculation Building on the proof of Equation (13), we hypothesize that the combination law for RB in the complex arithmetic calculation is the harmonic average of the arithmetic calculation RB and calculation planning RB. To verify this, we designed an experiment focusing on formulas containing addition, subtraction, and multiplication, like “ ${ \\bf \\bar { \\Psi } } ( 1 + { \\bf \\Psi }$ $2 ) * 3 - 4 ^ { \\prime \\prime }$ . Since addition and subtraction complexities are assumed to be around 1e15 (as shown in Figure 13), the arithmetic calculation RB primarily depends on the multiplication RB and calculation planning RB. Therefore, as shown in Figure 3 (a), there are two obvious RB lines, namely $B _ { A c c = 9 0 \\% }$ and ${ B _ { A c c = 1 0 \\% } }$ , which are completely consistent with the combination law of these basic RB based on the Equation (2). Besides, these two lines also clearly divide the RBs into three categories.\n\nCombination Law in Mathematical Reasoning Inspired by Tan [2023b], Xiao and Liu [2024], we posit that the natural language mathematical CoT task is determined by two sub-tasks: step planning task and step calculation task for global logic planning and local mathematical calculation. Furthermore, each model output step requires a single basic operation, resulting in a step calculation boundary close to the maximum number of multiplications, denoted by $\\vec { B } ( c \\bar { ) } \\approx B ( m \\bar { ) }$ . Formally, with step planning RB denoted by $( B ( p ) )$ and the step calculation RB by $( B ( c ) )$ , then the combined RB satisfies the following law:\n\n$$\n\\mathcal { B } ^ { \\mathrm { c o T } } ( c , p ) = \\frac { 1 } { \\frac { N _ { 1 } } { ( \\mathcal { B } ( c ) - b _ { 1 } ) } + \\frac { N _ { 2 } } { ( \\mathcal { B } ( p ) - b _ { 2 } ) } } .\n$$\n\nAs illustrated in Figure 3 (b), the actual performance distribution of RB (including $B _ { A c c = 9 0 \\% }$ and $\\scriptstyle B _ { A c c = 1 0 \\% } ,$ ) in natural language mathematical reasoning task fully aligns with the proposed combination law in Equation (3). Additionally, there are also obviously three RBs in Figure 3 (b).\n\nCombination Law in Multi-hop Reasoning Beyond the realm of mathematics, we further extend our exploration of the combination law to the field of multi-hop question answering. Specifically, we validate our law on HotpotQA [Yang et al., 2018], where we define the reasoning boundary as the combination of global hop-planning RB and local knowledge entity reasoning RB. As shown in Figure 3 (c), $B _ { A c c = 9 0 \\% }$ and $B _ { A c c = 1 0 \\% }$ also satisfy the weighted harmonic mean of these two sub-reasoning boundaries. It is also proved that, in addition to math-related tasks, multi-hop question answering also satisfies our proposed combined law and also exhibits three distinct RBs. We will describe in detail how to calculate the combination law on multi-hop reasoning in Appendix E.\n\n# 4.3 Nature Analysis for different Reasoning Boundary\n\nAccording to the definition of different RBs, we have divided the problem into three parts for LLMs. In this section, we will verify whether the defined RB adheres to the intrinsic nature of the model itself. We will discuss the natures of these RBs in detail:\n\nCFRB means complete mastery of the model even without demonstration. According to the definition, we assume that a question within CFRB implies a comprehensive understanding of the associated issue for a certain LLM. To verify this, following Zhang et al. [2022] and Wei et al. [2022], we formulate a mathematical request and generate chain-of-thought rationale and answer through\n\nCFRB PFRB CIRB CFRB PFRB CIRB ΔCFRB ΔPFRB ΔCIRB CFRB PCFRB IFRB Error 8650 84.1 896570 89.7 89.7 90.7 91.6 5 Accuracy (%) 75 77.1 5305 54.9 53.0 54.8 56.5 57.4 3 Δ Accuracy (%) 55 51.1 50.0 45 2 1% 30 △ 9% 12.7 20 1 CFRB PFRB CIRB 9.5 9.5 9.5 9.5 25 5 10 65% Reasoning Boundary Type #1 #3 #4 #5 (a) The accuracy distribution of The size of self-consistency (c) The accuracy (top) and quantity generated rationales based on Auto- (b) Model self-consistency integrated performance in dif- (bottom) distribution of synthetic CoT and Zero-CoT. ferent Reasoning Boundary areas. samples from Synthetic-CoT.\n\nzero-shot prompting without any demonstration. As shown in Figure 4 (a), it still achieves $2 9 . 2 \\%$ improvement in CFRB on generating the correct rationale compared to other RBs. This also proves that the model can indeed master tasks well on the questions in CFRB.\n\nPFRB means moderate confidence in its solution and needs consensus building process. To gauge the level of performance and confidence, we draw parallels to human decision-making, where moderate confidence often necessitates multiple times of consensus building. Inspired by this, we investigate it on Self-Consistency [Wang et al., 2022], which integrates results from various reasoning answers to reach a conclusive answer. Figure 4 (b) demonstrates that as the integration of reasoning paths increases, the accuracy improves significantly within PFRB compared with other RBs. This suggests that within PFRB, the LLM exhibits moderate confidence in solving problems, which needs multiple consensus building.\n\nCIRB exhibits poor reasoning performance even with consensus building. As illustrated in Figure 4 (a), questions in CIRB display extremely low accuracy (around $9 . 5 \\%$ ). And the model shows consistently poor performance and no improvement on Self-consistency in this boundary in Figure 4. It signifies that the model exhibits poor reasoning performance.\n\nLLM has self-awareness of its own RBs. In parallel, a natural question arises: Is the model capable of discerning its inherent RBs? To investigate this, we employ the Synthetic-CoT [Shao et al., 2023] to prompt LLM to generate CoT data. As depicted in Figure 4 (c), the results demonstrated that there are over $65 \\%$ of generated samples within CFRB, which achieves a much higher percentage and performance than other RBs. This suggests that LLMs possess an intrinsic understanding of their RBs and constraints to generate the task they grasp, indicative of a potential for self-assessment.\n\nTakeaways: (1) Reasoning boundary (RB) and the combination law of RB are both widespread across a series of tasks. (2) Different categories of RB can reflect the corresponding performance, and the model can also have a self-understanding of its own RB.\n\n# 5 RB-based CoT Optimization\n\n# 5.1 How can we improve CoT by optimizing RB?\n\nBased on our framework, the reasoning boundary limits the performance of the model. The simplest approach to improve CoT is to optimize the step calculation RB $\\boldsymbol { B } ( \\boldsymbol { c } )$ to promote the value of RB. Specifically, Tool-Usage [Paranjape et al., 2023] and Program-of-Thought (PoT) [Chen et al., 2024b] have shown significant success in CoT optimization. We explain the rationale behind their effectiveness, why PoT consistently outperforms direct Tool Usage [Yao et al., 2023, Chen et al., 2023], and take them as examples to demonstrate how to improve CoT by promoting RB.\n\nTool Usage can boost the value of RB for an LLM. When the model uses tools [Paranjape et al., 2023], we can simply think that the model can perform calculations with infinite precision, so that the RB of mathematical calculations tends to infinity, viz ${ \\cal B } ( c )  + \\infty$ . It is obvious that the combined\n\n<html><body><table><tr><td rowspan=\"2\">Model</td><td colspan=\"3\">BIGGSM</td></tr><tr><td>Acc. (↑)</td><td>Input Token (↓)</td><td>Output Token (↓)</td></tr><tr><td>CoT</td><td>57.00 ±0.93</td><td>780.43</td><td>96.76 ±3.22</td></tr><tr><td colspan=\"4\">RB-Optimized Methods</td></tr><tr><td>Tool Usage</td><td>71.64 ±0.66</td><td>688.43</td><td>129.53 ±3.82</td></tr><tr><td>PoT</td><td>78.25 ±1.09</td><td>657.43</td><td>78.25 ±1.09</td></tr><tr><td colspan=\"4\">Reasoning-Path-Optimized Methods</td></tr><tr><td>Least-to-most</td><td>58.25 ±3.28</td><td>679.59</td><td>176.09 ±15.22</td></tr><tr><td>Complex-CoT</td><td>59.78 ±0.60</td><td>1111.43</td><td>131.82 ±1.91</td></tr><tr><td>CoT+MARP</td><td>64.37 ±2.24</td><td>614.43</td><td>95.12 ±0.77</td></tr><tr><td>PoT+MARP</td><td>80.55 ±2.40</td><td>576.43</td><td>76.34 ±2.84</td></tr></table></body></html>\n\nTable 1: Main experimental results on GPT-3.5-Turbo.   \nResults on different benchmarks are shown in Table 2.\n\n![](images/dd9be8e055cb0b5c6cfdbe165b214dd5f603ced72180639d37d1cbb8ba794b43.jpg)  \nFigure 5: Analysis of the impact of ToolUsage and PoT on reasoning boundary $B ( c , \\bar { p } )$ .\n\nRB of the model can be calculated as:\n\n$$\n\\mathcal { B } ^ { \\mathrm { T o o l } } ( c , p ) = \\operatorname* { l i m } _ { \\mathcal { B } ( c ) \\to + \\infty } \\frac { 1 } { \\frac { N _ { 1 } } { ( \\mathcal { B } ( c ) - b _ { 1 } ) } + \\frac { N _ { 2 } } { ( \\mathcal { B } ( p ) - b _ { 2 } ) } } = \\frac { \\mathcal { B } ( p ) - b _ { 2 } } { N _ { 2 } } .\n$$\n\nEasy to get, $\\beta ^ { \\mathrm { T o o l } } ( c , p ) > B ^ { \\mathrm { c o T } } ( c , p )$ , this shows that Tool Usage can improve the boundary of reasoning. This explains why Tool Usage can have better performance than vanilla CoT (as shown in Table 1). Furthermore, as shown in Figure 5, the distribution of theoretical RB and the actual one almost perfectly coincide. This also demonstrates the reliability and applicability of our theory.\n\nProgram-of-Thought can further enhance the value of LLM’s RB. Equation (4) reveals that an LLM’s RB hinges entirely on its planning capability. Since natural language can be verbose, it hinders the planning capability of LLM [Gao et al., 2023, Hu et al., 2023, Puerto et al., 2024, Chen et al., 2024b]. PoT [Chen et al., 2023] offers a clearer representation of logic using code, allowing for clearer planning (as shown in Figure 2 (b, c)). This leads to finer-grained planning reasoning $B ^ { * } ( p ) > B ( p )$ . Then the PoT reasoning boundary ${ \\cal B } ^ { \\sf P o T } ( c , p ) > { \\cal B } ^ { \\sf T o o 1 } ( c , p )$ , aligning with the observed performance gains of PoT over Tool Usage (see Table 1). Furthermore, Figure 5 visually demonstrates that PoT’s theoretical and practical reasoning boundaries consistently outperform Tool Usage. This reinforces the theoretical advantage of PoT and its empirical effectiveness.\n\n# 5.2 How can we improve CoT based on a certain RB?\n\nEnhancing RB is crucial for optimizing CoT, but requires changes to the model or its reasoning architecture to be effective. Therefore, we need to consider how to optimize the reasoning path so that the difficulty satisfies the RB $\\begin{array} { r } { \\mathopen { } \\mathclose \\bgroup \\left( d ^ { * } = B _ { A c c = K _ { 1 } } \\aftergroup \\egroup \\right. } \\end{array}$ ) instead of the original RB $\\begin{array} { r } { \\dot { \\boldsymbol { \\mathcal { d } } } = \\boldsymbol { B } _ { A c c = K _ { 2 } } } \\end{array}$ ), where $K _ { 2 } < K _ { 1 }$ . According to Equation (3), $\\boldsymbol { B }$ is affected by both arithmetical RB and planning RB. Given $\\boldsymbol { B }$ , we consider optimizing reasoning ability from the following two strategies as examples 2:\n\nComplex CoT (CCoT): By increasing the boundary of planning to reduce the pressure of single-step calculation, reduce the arithmetical RB, and then get smaller $d$ ; However, it introduces more planning steps, which adds the planning pressure. As shown in Figure 6, the model performance first increases and then decreases with the increasing number of CCoT steps.\n\nLeast-to-Most (LtM): By dividing multiple sub-questions to reduce the pressure of local planning within a sub-question, reduce the boundary of local planning, and then get smaller $d$ . However, even though it can release local planning pressure (as demonstrated in Figure 7), this approach simultaneously intensifies global planning pressure by generating an excessive number of subquestions (as depicted in Figure 15).\n\nLimitation: (1) CCoT needs to keep balance in the number of reasoning steps and calculation pressure. (2) Although the pressure of local planning has been reduced, LtM has not effectively reduced the pressure of global planning, nor the pressure of optimization calculations.\n\nMinimum acceptable reasoning paths prompting can further achieve better CoT within a specific RB. To address the aforementioned two issues, we proposed Minimum Acceptable Reasoning\n\n![](images/2fb5e3a648989c40c91f1cd35400a39768e50bb2b0c604735ebcc3ffd3e95c77.jpg)  \nFigure 6: Correlation between the number of steps and performance of Complex-CoT on GSM8K (left) and SingleEq (right). See Appendix G for more meta-analysis results.\n\n![](images/64b4845a9add376a16abc3ac6de2443ac45d43d912a81752580ef88316a325e5.jpg)  \nFigure 7: The performance distribution of Least-to-Most prompting on different calculation amounts.   \nFigure 8: Correlation between the values of RB for different models and performance on real benchmarks. See Appendix $\\mathrm { ~ H ~ }$ for more empirical details.\n\nPaths (MARP). Our first objective is to alleviate the computational burden of the model. We achieve this by introducing instructions that set an upper limit on its single-step computational capacity, thereby optimizing the boundary of its computational reasoning. Secondly, we aim to enhance the model’s acceptability. Within the calculation and planning boundary, we increase the amount of computation performed in each step in demonstrations as much as possible while simultaneously reducing the number of global planning steps, which effectively mitigates planning pressure. As shown in Table 1, MARP demonstrably improves model performance and effectively reduces the token consumption. By maximizing operations per step, MARP leads to a more streamlined and efficient problem-solving process. Detailed descriptions of this strategy are shown in Appendix G.3.\n\nTakeaways: (1) Tool-Usage and PoT can be utilized to optimize CoT by the calculation and planning reasoning boundary optimization. (2) MARP can well lessen planning and calculation pressure by problem optimization in certain RB (3) Users can effectively optimize CoT performance by optimizing the reasoning boundary and the problem.\n\n# Expansion Verification & Exploration\n\nRB can be extended to various models. To extend our mechanism’s applicability, we verify the mechanism on 25 diverse models (details in Table 3). As shown in Figure 8 (a), we observe a positive correlation between reasoning boundary and model accuracy on mathematical benchmarks. Moreover, the models that use mathematical data such as MathInstruct for SFT, often have interesting outliers that are different from the general LLMs’ area, but they also satisfy a positive correlation with\n\nGeneral LLM Math LLM Math LLM Closed LLM Open LLM GSM8k BigGSM MATH GSM8k BigGSM MATH GSM8k BigGSM MATH 95 → 95 ← 95 ? Accuracy (%) 50 8605 □ Accuracy (%) 8605 50 £ Accuracy (%) 50 65 □ □ 厂 女 35 35 1 35 20 20 20 1 公 A 5 5 5 0 0.2 0.4 0.6 0.8 0 0.2 0.4 0.6 0.8 0 … 0.1 0.102 0.104 0.106 0.108 𝓑!\"\"'(%% 𝓑!\"\"'(%% 𝓑!\"\"#\\$%% (a) Correlation between the values of CIRB (b) Correlation between the values of CIRB (b) Correlation between the values of CFRB $\\pmb { \\mathcal { B } } _ { \\mathrm { A c c < 1 0 \\% } }$ for different general LLMs and $\\pmb { \\mathcal { B } } _ { \\mathrm { A c c < 1 0 \\% } }$ for different math LLMs and $\\pmb { \\mathcal { B } } _ { \\mathrm { A c c } \\geq 9 0 \\% }$ for different closed and open performance on real benchmarks. performance on real benchmarks. LLMs and performance on real benchmarks.\n\n![](images/29183097bf592a885eb256447aff4881ffcfbbb7ad498a6e6099b77214726694.jpg)  \nFigure 9: Scaling law correlation between model parameters and CIRB.\n\n![](images/be4f4953c8bc0f368411cbac132e1c1f182e01e9b989edd37af464b4041f91e9.jpg)  \nFigure 10: Different boundaries on MGSM.\n\nour RBs (as shown in Figure 8 (b)), which helps determine if the model underwent mathematically targeted training.\n\nHowever, as shown in Figure 8 (c), we find some interesting phenomena. For example, the main difference between the current open-source model and the closed-source model is still CFRB. Except for the closed source model, the CFRB of all models is 0. It shows the potential and the direction of the model optimization. Furthermore, a scaling law of RB can also emerge (as shown in Figure 9): reasoning boundary increased with model parameter count and data quality.\n\nRB can be extended to more tasks. To assess the RB in more tasks, we evaluate them on a multilingual mathematical reasoning task. Inspired by Qin et al. [2024b], we hypothesize that multilingual RB, assessed through direct answer accuracy across different languages, mathematical computation RB, represented by the maximum product result, and reasoning planning RB, indicated by the planning steps, are orthogonal dimensions of performance. We propose that these RBs can be effectively combined using a weighted harmonic mean. As illustrated in Figure 10 confirms that the combined RB maintains the expected three different RBs. Detailed implementation description is shown in Appendix I.\n\n# 7 Related Work\n\nIn this section, we review recent literature related to Chain-of-Thought (CoT) prompting, focusing on theoretical and empirical investigations. Madaan et al. [2023], Wang et al. [2023a], Saparov and He [2023], He-Yueya et al. [2023], Zhang et al. [2024], Wang et al. [2024] and Prystawski et al. [2024] qualitatively show that the LLMs learn the reasoning chain based on the demonstrations in the context. Besides, Lampinen et al. [2022] and Tan [2023a] find a causal link between generated intermediate steps and the final answers during a series of qualitative experiments. Wang et al. [2023c], Hanna et al. [2024] and Dutta et al. [2024] study neural substructure within the LLMs, embodying CoT reasoning from a white-box mechanism perspective, demonstrating that LLMs deploy multiple parallel answer generation paths internally.\n\nRecently, a large amount of work has demonstrated the upper-bounds and limitations of LLM in various CoT tasks [Qin et al., 2023, Imani et al., 2023, Huang et al., 2024, Sprague et al., 2024]. Bi et al. [2024] investigate these bounds on planning capability in code generation by training LLM on CoT samples of varying difficulties. Their findings suggest that LLMs have a limited capacity to learn or manage tasks exceeding a certain complexity threshold. Further understanding of the CoT upper-bound, Merrill and Sabharwal [2023], Li et al. [2023] and Feng et al. [2024] analyze single-step arithmetic capability, which suggests an upper bound on model performance related to input length in single-step reasoning processes.\n\nDespite advancements in CoT explanation for LLMs, significant challenges remain, including the absence of quantifiable metrics for CoT’s upper-bounds and the deficiency in optimization guidelines. To tackle this, we propose a reasoning boundaries framework (RBF) to systematically quantify and optimize various CoT approaches. This framework offers a transferable and user-friendly\n\n? Correct sample Incorrect sample CFRB PFRB CIRB Maximum multiplication calculation value (𝓑(m)) 3e5 XX X Maximum multiplication calculation value (𝓑(m)) 3e5 X × x Maximum multiplication calculation value (𝓑(m)) 3e5 ? O ： XX · X X 2.52e5 × XX 1 2.52e5 8 × X X 2.52e5 + 1 × + 1.5e5 1e5 ? . SE E XXX × XX 1.5e5 1e5 X + X X 1.5e5 1e5 5e4 8 ： 美艾 X x 5e4 : ： ? 5e4 0 6 + X X X 0 + X . 0 x88x0 1 4 7 10 13 16 1 4 7 10 13 16 1 4 7 10 13 16 The number of planning step (𝓑(p)) The number of planning step (𝓑(p)) The number of planning step (𝓑(p)) (a) GPT-3.5-turbo (b) GPT-4o (c) O1-preview\n\nmethodology to enhance model performance from a mechanistic perspective. We anticipate that it will furnish systematic insights for ongoing research and inform future developments in the field.\n\n# 8 Discussion\n\nDiscussion on the Boundaries Improvements Furthermore, in order to better understand the best existing LLMs, we utilize RBF to test the current most advanced GPT-series models. As shown in Figure 11, all reasoning boundaries improve a lot compared to the last version which also achieves performance enhancement. Notably, the CFRB increases slightly compared with the improvement of CIRB between GPT-3.5 and GPT-4o. But o1 significantly improves the CFRB. Furthermore, as shown in Figure 14 in Appendix, o1 shows extremely significant improvements on CFRB, which is almost three times of other models. We attribute it to the fact that the advanced Reinforce-Learning and Inference Scaling strategies play a key role in improving this part of the ability compared with the normal improvements in CFRB, which might trigger more in-depth research.\n\nBroader impacts. Our framework is the first work to quantify the reasoning upper-bound of LLMs. This enables the explanation for a huge part of the valid CoT framework. We hope that our work can provide new insights and more systematic guidance for future interpretability analysis of CoT. For social impact, this work may have a certain impact on the controllable and explainable AGI.\n\nLimitations & Future. Due to the cost and time constraints, this work does not discuss the complex relationships such as causal conditions among the basic RBs. In addition, evaluating the robustness and applicability of CoT reasoning boundaries-related techniques in dynamic scenarios will be crucial for future research.\n\n# 9 Conclusion\n\nThis study introduces a novel reasoning boundaries framework (RBF) to quantify and optimize the limitations of LLMs in CoT tasks. Specifically, we propose the concept of reasoning boundaries (RBs) and the combination law of RBs in more complex scenarios for quantitative metrics. We further introduce three categories of RB for CoT optimizations. The framework is validated through extensive experiments across 27 models and 5 tasks. Furthermore, we improve the CoT in both RB and question optimization perspectives to achieve state-of-the-art performance in BIGGSM. We hope that this framework paves the way for further research on understanding and enhancing LLMs’ reasoning capabilities.",
    "summary": "{\n    \"core_summary\": \"### 核心概要\\n\\n**问题定义**\\n现有关于思维链（Chain-of-Thought, CoT）的研究存在两大挑战：一是缺乏量化CoT能力的指标，难以客观比较不同CoT方法并确定其能力上限；二是缺乏优化CoT性能的指导，阻碍了将CoT研究转化为提升模型能力的可行策略。这些问题严重制约了对大语言模型（LLMs）在复杂推理任务中性能的深入理解与提升。\\n\\n**方法概述**\\n论文提出推理边界框架（Reasoning Boundary Framework, RBF），通过定义推理边界（Reasoning Boundary, RB）量化CoT上限，建立RB组合定律以适应复杂场景；提出三类RB，并基于组合定律和其性质，通过提升RB和优化推理路径优化现有CoT策略。\\n\\n**主要贡献与效果**\\n- 首次提出推理边界框架（RBF）量化CoT上限，建立RB组合定律作为基本RB的加权调和均值，可应用于实际CoT任务。\\n- 定义三类RB，基于组合定律和其性质，通过提升RB和优化推理路径有效改进现有CoT策略，如在BIGGSM基准测试中，PoT+MARP方法准确率达到80.55 ± 2.40%，高出CoT的57.00 ± 0.93%。\\n- 在27个模型和5个CoT任务上验证框架的存在性和合理性，从两个优化视角解释众多CoT策略的最优性能。\",\n    \"algorithm_details\": \"### 算法/方案详解\\n\\n**核心思想**\\n该方法的核心思想是引入推理边界（RB）概念，量化大语言模型在特定推理过程中的能力上限，解决现有研究缺乏量化指标和优化指导的问题。通过建立RB组合定律，考虑多个能力合作对模型推理边界的影响，准确评估模型在复杂任务中的表现。定义三类RB，根据其性质和组合定律优化CoT策略，提升模型推理性能。其有效性在于能准确衡量模型推理能力边界，从而有针对性地优化。\\n\\n**创新点**\\n先前的研究主要依赖定性评估CoT性能，缺乏量化指标，且在优化CoT性能方面缺乏指导。本文的创新点在于：首次提出推理边界框架（RBF），为CoT能力提供量化指标；建立RB组合定律，适用于更复杂的实际场景；定义三类RB并基于此优化CoT策略，为提升模型性能提供具体方法。\\n\\n**具体实现步骤**\\n1. **定义推理边界（RB）**：对于模型 $m$ 和任务 $t$，RB定义为模型在达到预定义准确率阈值 $K_1$ 时的最大问题难度 $d$，即 $B_{Acc = K_1}(t|m) = \\sup_d \\{ d | Acc(t|d, m) = K_1 \\}$，难度可通过推理步骤数或计算复杂度等因素衡量。\\n2. **建立RB组合定律**：对于 $n$ 个任务，模型 $m$ 的统一推理边界 $\\mathcal{B}_{Acc = K_1}(t_1, t_2, \\dots, t_n|m) \\approx \\frac{1}{(n - 1) \\sum_{i = 1}^{n} \\frac{N_i}{\\mathcal{B}_{Acc = K_1}(t_i|m) - b_i}}$，其中 $B_{Acc = K_1}(t_i|m)$ 表示模型 $m$ 对任务 $t_i$ 的推理边界，$N_i$ 和 $b_i$ 是仅受相关任务影响的缩放因子。\\n3. **定义三类RB**：根据经验准确率，将RB分为完全可行推理边界（CFRB，$Acc \\geq 90\\%$）、部分可行推理边界（PFRB，$10\\% < Acc < 90\\%$）和完全不可行推理边界（CIRB，$Acc \\leq 10\\%$）。\\n4. **优化CoT策略**：通过提升RB（如使用Tool-Usage和Program-of-Thought）和优化推理路径（如Complex CoT、Least-to-Most、Minimum Acceptable Reasoning Paths）改进现有CoT策略。\\n\\n**案例解析**\\n在基本算术计算任务中，以乘法为例，当结果小于等于2.2e5时，准确率超过90%；当结果超过2e6时，准确率低于10%，体现了推理边界的存在。在自然语言规划任务中，当推理步骤少于2步时，准确率超过90%；当推理步骤超过4步时，准确率低于10%，展示了不同的推理边界类别。在代码规划任务中，与自然语言规划类似，也存在明显的推理边界划分，且由于代码逻辑更清晰、表达复杂度降低，其规划准确率高于自然语言规划。\",\n    \"comparative_analysis\": \"### 对比实验分析\\n\\n**基线模型**\\n论文中用于对比的核心基线模型为CoT。\\n\\n**性能对比**\\n*   **在 [准确率/Accuracy] 指标上：** 本文提出的方法在BIGGSM数据集上取得显著性能提升。其中，Tool Usage方法的准确率达到71.64 ± 0.66%，高出CoT的57.00 ± 0.93%；PoT方法进一步提升到78.25 ± 1.09%；PoT+MARP方法表现最佳，准确率达到80.55 ± 2.40%，远优于基线模型CoT。Least-to-most方法的准确率为58.25 ± 3.28%，Complex-CoT方法的准确率为59.78 ± 0.60%，CoT+MARP方法的准确率为64.37 ± 2.24%，均高于CoT。\\n*   **在 [输入令牌数/Input Token] 指标上：** CoT的输入令牌数为780.43，而本文提出的方法在减少输入令牌数方面表现出色。Tool Usage的输入令牌数降低到688.43，PoT进一步降低到657.43，PoT+MARP的输入令牌数最低，为576.43，低于CoT，表明这些方法在资源利用上更高效。Least-to-most的输入令牌数为679.59，Complex-CoT的输入令牌数为1111.43，CoT+MARP的输入令牌数为614.43，部分方法低于CoT。\\n*   **在 [输出令牌数/Output Token] 指标上：** CoT的输出令牌数为96.76 ± 3.22，Tool Usage的输出令牌数为129.53 ± 3.82，PoT的输出令牌数为78.25 ± 1.09，PoT+MARP的输出令牌数为76.34 ± 2.84，低于CoT，说明本文部分方法在输出结果的简洁性上具有优势。Least-to-most的输出令牌数为176.09 ± 15.22，Complex-CoT的输出令牌数为131.82 ± 1.91，CoT+MARP的输出令牌数为95.12 ± 0.77。\",\n    \"keywords\": \"### 关键词\\n\\n- 大语言模型 (Large Language Models, LLMs)\\n- 思维链推理 (Chain-of-Thought Reasoning, CoT)\\n- 推理边界框架 (Reasoning Boundary Framework, RBF)\\n- 推理边界 (Reasoning Boundary, RB)\\n- 推理边界组合定律 (Combination Law of Reasoning Boundary, CLRB)\\n- 复杂推理任务 (Complex Reasoning Tasks, CRT)\"\n}"
}